{
    "dc_identifier_s": null,
    "dc_rights_s": "Public",
    "dc_title_s": "Real Estate Sales, New York NY, 2018",
    "dct_provenance_s": "Baruch CUNY",
    "geoblacklight_version": "1.0",
    "layer_slug_s": null,
    "solr_geom": "ENVELOPE(-74.25585,-73.69948,40.914926,40.495909)",
    "solr_year_i": 2018,
    "dc_creator_sm": [
        "Anastasia Clark",
        "Frank Donnelly"
    ],
    "dc_description_s": "This point layer represents locations of all real estate sales in New York City for one calendar year. Each feature represents a property that was sold, with attributes that describe address, block and lot, neighborhood, building categories, property area, and sale price in nominal dollars. Sales include residential, commercial, industrial, and vacant properties, and represent both individual units and entire buildings. The original data was published by the New York City Department of Finance in their Detailed Annual Sales Reports by Borough. The GIS Lab at Baruch College CUNY wrote a Python script to collate the spreadsheets for each of the boroughs into one table and geocoded the records using the NYC Geoclient API, developed by the NYC Department of Information Technology and Telecommunications GIS / Mapping unit. Longitude and latitude coordinates were obtained via the API by performing an address match; if the address match failed a parcel match was attempted using block and lot attributes. If both matches failed, coordinates were identified manually using a library of tax maps and Google Maps. Because coordinates were obtained through different means their positional accuracy varies; the type of match is recorded in a dedicated column. Given the vertical nature of real estate in New York, many sales will occupy the same location. The GIS Lab added an additional column called 'usable' that indicates whether a sale likely represents an arms-length market transaction or not; records with a sale price of $10 or less are flagged as non-usable. The lab added a sequential sale_id to uniquely identify each transaction, and a bbl_id that concatenates the borough code, block, and lot to uniquely identify each property. All other fields were generated by the original source and were not modified in any way. This dataset was created for non-commercial use for basic geographic analysis and map making.",
    "dc_format_s": "Shapefile",
    "dc_language_sm": "English",
    "dc_publisher_sm": "Newman Library (Bernard M. Baruch College)",
    "dc_source_sm": null,
    "dc_subject_sm": [
        "economy",
        "planningCadastre",
        "society",
        "structure"
    ],
    "dc_type_s": "Dataset",
    "dc_isPartOf_sm": "NYC Geocoded Real Estate Sales",
    "dct_issued_s": "2019-05",
    "dct_references_s": "{}",
    "dct_spatial_sm": [
        "New York City, New York, United States",
        "Bronx County, New York, United States",
        "Kings County, New York, United States",
        "New York County, New York, United States",
        "Queens County, New York, United States",
        "Richmond County, New York, United States",
        "Borough of Bronx, New York, United States",
        "Borough of Brooklyn, New York, United States",
        "Borough of Manhattan, New York, United States",
        "Borough of Queens, New York, United States",
        "Borough of Staten Island, New York, United States"
    ],
    "dct_temporal_sm": [
        "2018"
    ],
    "layer_geom_type_s": "Point",
    "layer_id_s": null,
    "layer_modified_dt": "2020-05-11T14:58:22EDT"
}